{
  "scholarship": {
    "basic_info": {
      "title": "Gyan Sadhana Scholarship 2025, Result, and Complete Details",
      "post_date": "July 21, 2024",
      "author": "Muhammad Saim Rasheed",
      "funding_type": "Government Funding",
      "host_countries": [
        "India"
      ],
      "program_name": "Gyan Sadhana Scholarship",
      "funded_by": "state government of Gujarat",
      "degree_levels": [],
      "duration": "1 year (renewable)",
      "scholarships_available": "25000",
      "deadline": "The application process starts in January and ends in February. Entrance exam will take place in March."
    },
    "program_details": {
      "description": "Gyan Sadhana Scholarship is a recently started initiative from the state government of Gujarat. It was inaugurated by the Chief Minister of Gujrat in 2023. This scholarship is provided to the students of classes 9 to 12, who are admirable in studies and financially deserving. This scholarship is designed to support students from various academic backgrounds, ensuring that financial problems don’t stop them from reaching their full potential in school.\n\nThis scholarship facilitated the passage of 25000 students from Gujarat state. It’s a big initiative and a prestigious opportunity for Gujarat students. This scholarship offers students up to INR 25000 per year to meet their educational expenses. The complete details about the scholarship and its requirements are given below.",
      "study_locations": [],
      "participating_universities": [],
      "program_structure": {},
      "subjects": [],
      "language": ""
    },
    "benefits": {
      "financial_coverage": [
        "20,000 per annum (for classes 9 and 10)",
        "25,000 per annum (for classes 11 and 12)"
      ],
      "additional_benefits": []
    },
    "eligibility": {
      "nationality": {
        "type": "all_inclusive",
        "eligible_nationalities": [],
        "excluded_nationalities": []
      },
      "academic": {
        "minimum_degree_required": null,
        "accepted_degrees": [],
        "minimum_gpa": null,
        "final_year_allowed": true,
        "specific_backgrounds": [],
        "academic_requirements": [
          "80% attendance is mandatory to be eligible for this scholarship.",
          "The applicant must be a student of Govt. recognized insitute.",
          "The student must have good marks in their previous exam.",
          "The student must have to obtain excellent marks in the entrance exam."
        ]
      },
      "language": {
        "english": {
          "required": false,
          "minimum_score": {},
          "waiver_conditions": []
        },
        "other_languages": []
      },
      "experience": {
        "required": false,
        "minimum_years": null,
        "type": [],
        "specific_fields": []
      },
      "age": {
        "minimum": null,
        "maximum": null,
        "exceptions": []
      },
      "other_criteria": {
        "research_requirements": [],
        "professional_requirements": [],
        "specific_skills": [],
        "additional_conditions": [
          "The student must be a Gujarati resident.",
          "The applicant must be a student of classes 9 to 12.",
          "The student’s family income should be below than INR 150,000 per annum."
        ]
      }
    },
    "application": {
      "required_documents": [
        "Marksheets and certificates of previous academic qualifications.",
        "Proof of family income issued by a competent authority.",
        "Aadhaar card, voter ID, or any other government-issued ID.",
        "Ration card, utility bills, or any other document as proof of residence.",
        "Recent passport-sized photos.",
        "Bank passbook or cancelled cheque for direct benefit transfer."
      ],
      "application_process": [
        "First, go to the Gujarat State Examination Board website (https://www.sebexam.org/)",
        "Click on the Gyan Sadhana Scholarship link.",
        "Then enter the U-DISE number and press the “SUBMIT” button to start the application process. (U-DISE number will be provided by the school principal)",
        "Fill in the details correctly that are required.",
        "Attach the required verified documents and click the “Submit”  button to finish the application process.",
        "Then print out the application form and send this application form along with the required documents to the concerned District Education Officer.",
        "After completing the application process keep visiting the website, because, after the last date of the application process, the board will send you the admit card to take the exam.",
        "Download the admit card before going for the exam, because without admit card you will not be able to take part in the exam."
      ],
      "application_link": "https://www.sebexam.org/"
    },
    "metadata": {
      "shares_count": null,
      "related_programs": [],
      "source_url": "https://opportunitiescorners.com/gyan-sadhana-scholarship/",
      "categories": [
        "Bachelor, Master, PhD Scholarships"
      ]
    }
  }
}