{
  "scholarship": {
    "basic_info": {
      "title": "HDFC Bank Parivartan ECSS Programme 2024-25",
      "post_date": "July 19, 2024",
      "author": "Muhammad Saim Rasheed",
      "funding_type": "Fully Funded",
      "host_countries": [
        "India"
      ],
      "program_name": "HDFC Bank Parivartan Educational Crisis Scholarship Support (ECSS) Programme",
      "funded_by": "HDFC Bank",
      "degree_levels": [
        "Bachelor",
        "Master",
        "PhD"
      ],
      "duration": "1 Year, renewed based on performance",
      "scholarships_available": "",
      "deadline": "04 September 2024"
    },
    "program_details": {
      "description": "Are you a class 1 to 12 student facing financial challenges that can stop your educational journey? Worry not because the HDFC Bank Parivartan Educational Crisis Scholarship Support (ECSS) Programme brings you the solution for your financial crisis. If you are a brilliant student who secured excellent marks in your previous exam and also facing financial problems, you can grab this scholarship.\n\nThis HDFC Scholarship an initiative by the HDFC Bank is specially designed to support the underprivileged sections of society. Previously students of classes 1 to 12 and those studying diploma, ITI, polytechnic, UG, and PG (general and professional) programs were only eligible to apply for this scholarship. But now HDFC has increased the number of scholarships and now it is also available for Undergraduate and Postgraduate students.",
      "study_locations": [],
      "participating_universities": [],
      "program_structure": {},
      "subjects": [],
      "language": ""
    },
    "benefits": {
      "financial_coverage": [
        "INR 35,000 per annum (for general PG students)",
        "INR 75,000 per annum (for professional PG students)",
        "INR 30,000 per annum (for general UG students)",
        "INR 50,000 per annum (for professional UG students)",
        "INR 15,000 per annum (for class 1 to 6 students)",
        "INR 18,000 per annum (for classes 7 to 12 and Diploma, ITI, & Polytechnic students)"
      ],
      "additional_benefits": []
    },
    "eligibility": {
      "nationality": {
        "type": "all_inclusive",
        "eligible_nationalities": [
          "India"
        ],
        "excluded_nationalities": []
      },
      "academic": {
        "minimum_degree_required": null,
        "accepted_degrees": [],
        "minimum_gpa": "55%",
        "final_year_allowed": false,
        "specific_backgrounds": [],
        "academic_requirements": []
      },
      "language": {
        "english": {
          "required": true,
          "minimum_score": {
            "ielts": null,
            "toefl": null,
            "other": null
          },
          "waiver_conditions": []
        },
        "other_languages": []
      },
      "experience": {
        "required": false,
        "minimum_years": null,
        "type": [],
        "specific_fields": []
      },
      "age": {
        "minimum": null,
        "maximum": null,
        "exceptions": []
      },
      "other_criteria": []
    },
    "application": {
      "required_documents": [
        "Recent passport-sized photographs",
        "Identity Proof:\nAadhaar Card\nVoter ID\nPassport\nDriving License",
        "Mark sheets of the previous academic year",
        "Admission letter of current year and current year’s fee receipt",
        "Bank passbook or a canceled cheque from the applicant’s bank account",
        "Income Certificate Proof issued by a competent authority (i.e; Gram Panchayat/Ward Counsellor/Sarpanch/SDM/DM/CO/Tehsildar OR salary slip.",
        "Affidavit",
        "Documents supporting the personal or family crisis (e.g., medical reports, death certificate of earning family member, etc.)"
      ],
      "application_process": [
        "Visit the official HDFC Bank scholarship page or Buddy4Study website (a partner platform) and look for the “Apply Now” button for the specific scholarship category that aligns with your program.",
        "There you will have to create your account, and then sign in with your registered email and password. Then it will directly take you to the application form page.",
        "Click on the “Start Application” button to fill in the application form.",
        "Fill in all the required fields accurately.",
        "Scan and upload all the required documents.",
        "Carefully review all the entered information and uploaded documents.",
        "Make any necessary corrections before final submission.",
        "Once you are sure that all the information is accurate, click on the ‘Submit’ button."
      ],
      "application_link": ""
    },
    "metadata": {
      "shares_count": null,
      "related_programs": [
        "ONGC Scholarship 2024-25 Fully Funded, Apply Online",
        "The Gates Scholarship Program 2025 in USA (Fully Funded)"
      ],
      "source_url": "https://opportunitiescorners.com/hdfc-bank-parivartan-ecss-programme/",
      "categories": [
        "Bachelor, Master, PhD Scholarships"
      ]
    }
  }
}