{
  "scholarship": {
    "basic_info": {
      "title": "TS ePASS Scholarship 2024-25 Status, Amount Details, Eligibility",
      "post_date": "July 21, 2024",
      "author": "Muhammad Saim Rasheed",
      "funding_type": "Partially Funded/Fully Funded + Loan",
      "host_countries": [
        "India"
      ],
      "program_name": "Telangana TS ePASS Scholarship",
      "funded_by": "Telangana state government",
      "degree_levels": [
        "School",
        "Intermediate",
        "Undergraduate",
        "Postgraduate",
        "Master's",
        "M.phil",
        "PhD"
      ],
      "duration": "Varies",
      "scholarships_available": null,
      "deadline": "Opens in July/August and ends in September/October"
    },
    "program_details": {
      "description": "Telangana TS ePASS Scholarship is one of the renowned scholarships across India. Students who are permanent residents of Telangana state are only eligible to apply for this prestigious scholarship program, offered by the Telangana state government. \n\nEvery year thousands of students are financially facilitated through this scholarship who belong to ST/SC/BC/EBC OR PWD categories. Students belonging to these categories are encouraged to apply and grab this opportunity to continue their studies. This scholarship is awarded to school-level students to postgraduate-level students. Each level is awarded with different amount of money from INR 100 per month to INR 20,00,000 per scholarship.",
      "study_locations": [],
      "participating_universities": [],
      "program_structure": {},
      "subjects": [],
      "language": null
    },
    "benefits": {
      "financial_coverage": [
        "INR 100 per month for Boys in Classes 5-8",
        "INR 150 per month for Girls in Classes 5-8",
        "INR 150 per month for Day scholars in Classes 9-10",
        "Rs. 750 annually for books for Day scholars in Classes 9-10",
        "INR 350 per month for Hostellers in Classes 9-10",
        "Rs. 1000 annually for books for Hostellers in Classes 9-10",
        "INR 850 per month for Intermediate students",
        "INR 690,000 for Undergraduate students",
        "INR 20,00,000 as a scholarship amount",
        "INR 10,00,000 as a loan amount",
        "Visa fees",
        "Travel expenses",
        "INR 10,00,000 as a scholarship amount",
        "INR 500,000 as a loan amount",
        "INR 10,00,000 as scholarship amount",
        "INR 500,000 as loan amount",
        "Visa fees",
        "Travel expenses"
      ],
      "additional_benefits": []
    },
    "eligibility": {
      "nationality": {
        "type": "all_inclusive",
        "eligible_nationalities": [
          "India"
        ],
        "excluded_nationalities": []
      },
      "academic": {
        "minimum_degree_required": null,
        "accepted_degrees": [],
        "minimum_gpa": null,
        "final_year_allowed": null,
        "specific_backgrounds": [],
        "academic_requirements": [
          "Must be a Telangana resident.",
          "Total family income must be lower than INR 200,000 per annum.",
          "Those students are only eligible to apply who are currently not receiving any other scholarship from the government and state.",
          "This scholarship is for students of classes 5-10.",
          "To be eligible for this scholarship, students must be currently attending a primary or secondary educational institution operated by a government body such as the Mandal Praja Parishad, Zilla Praja Parishad, Municipalities, Municipal Corporations, or the central/state government.",
          "The income and caste certificate must be verified and signed digitally by the designated authorities.",
          "Must be a Telangana resident.",
          "Telangana government states that:\n\nFor SC/ST family income must be lower than INR 200,000\nFor BC/EBC/PWD, who are residents of rural areas their family income should be lower than INR 150,000, and for those who belong to the same category but live in urban areas, their family income must be below INR 200,000 per annum.",
          "The applicant/student marks in the matriculation exam must be at least 75%.",
          "Must be a Telangana Resident.",
          "The student’s family income must be lower than INR 500,000 per annum.",
          "The age limit is 35 years.",
          "At least 60% marks in graduation.",
          "This scholarship only facilitates those who want to study postgraduation, Master’s, M.phil, OR PhD from a foreign country.",
          "Must be a Telangana resident.",
          "Family income must be lower than INR 200,000.",
          "Minimum of 60% marks in graduation.",
          "Maximum age is 30.",
          "Students with the ambition of studying postgraduation programs in a foreign country are encouraged to apply for this scholarship.",
          "Must be Telangana resident and belong to Scheduled Caste OR Scheduled Tribes.",
          "Family income must be lower than INR 500,000.",
          "Students must have secured at least 60% marks in graduation.",
          "The applicants will be eligible to study in the following countries only: USA, UK, Canada, Australia, Singapore, New Zealand, Japan, Germany, France, and South Korea."
        ]
      },
      "language": {
        "english": {
          "required": true,
          "minimum_score": {
            "ielts": "6.0",
            "toefl": "60",
            "other": null
          },
          "waiver_conditions": []
        },
        "other_languages": []
      },
      "experience": {
        "required": false,
        "minimum_years": null,
        "type": [],
        "specific_fields": []
      },
      "age": {
        "minimum": null,
        "maximum": "30",
        "exceptions": []
      },
      "other_criteria": {
        "research_requirements": [],
        "professional_requirements": [],
        "specific_skills": [],
        "additional_conditions": []
      }
    },
    "application": {
      "required_documents": [
        "Caste Certificate",
        "Income Certificate",
        "Aadhaar Card",
        "Latest Passport Size Photograph",
        "Bank Passbook: First page of the student’s bank passbook (for details like account number and IFSC code)",
        "Study/Bonafide Certificates for the Last 7 Consecutive Years",
        "Disability Certificate (If applicable)",
        "Previous Year’s Mark Sheets (For renewal applications)",
        "Ration Card",
        "Common Entrance Test (CET) Allotment Order (If applicable)"
      ],
      "application_process": [
        "Go to the official website of Telangana TS ePASS Scholarship.",
        "Click on the type of scholarship you want to apply according to your eligibility.",
        "Then click on the “Registration” button to start the application process.",
        "Fill in the all fields of the application form.",
        "Upload all the scanned copies of the required documents in one file.",
        "Carefully read the filled application form and then apply.",
        "After applying, you will be allocated a specific application number, note it down because it will be required in the next stages."
      ],
      "application_link": null
    },
    "metadata": {
      "shares_count": null,
      "related_programs": [],
      "source_url": null,
      "categories": [
        "Bachelor, Master, PhD Scholarships"
      ]
    }
  }
}